**FREE

// ------------------------------------------------------------------------------------
// getNumofCustomers
// ------------------------------------------------------------------------------------
dcl-pr getNumofCustomers packed(9) extproc;
end-pr;
